act
ast-grep
bash
bat
btop
caddy
cbonsai
code-server
csvlens
curl
ddgr
derailed/k9s/k9s
dnsmasq
doctl
eza
fastfetch
fd
flyctl
fnm
fzf
gh
git-lfs
gnu-sed
gource
graphviz
grpcurl
helm
htop
httpstat
jd
jq
k6
lftp
libpq
mkcert
mtr
neovim
nixpacks
nmap
nss
nushell
python-setuptools
qsv
railway
redis
ripgrep
squashfs
stripe/stripe-cli/stripe
surfraw
tailscale
telnet
templ
tldr
tmux
tree
vercel-cli
wget
yazi
yt-dlp
zellij
zoxide
zsh
